{
  "ir_version": "54",
  "units": {
    "length": "millimeter"
  },
  "tolerances": {
    "linear": 1e-6,
    "angular": 1e-10
  },
  "model": {
    "bodies": [],
    "regions": [],
    "shells": [],
    "faces": [],
    "loops": [],
    "coedges": [],
    "edges": [],
    "vertices": [],
    "points": [],
    "surfaces": [
      {
        "id": "synthetic:v2:surface#sum-cache",
        "geometry": {
          "kind": "plane",
          "origin": {
            "x": 0.0,
            "y": 0.0,
            "z": 0.0
          },
          "normal": {
            "x": 0.0,
            "y": 0.0,
            "z": 1.0
          },
          "u_axis": {
            "x": 1.0,
            "y": 0.0,
            "z": 0.0
          }
        }
      }
    ],
    "curves": [
      {
        "id": "synthetic:v2:curve#u",
        "geometry": {
          "kind": "line",
          "origin": {
            "x": 0.0,
            "y": 0.0,
            "z": 0.0
          },
          "direction": {
            "x": 1.0,
            "y": 0.0,
            "z": 0.0
          }
        }
      },
      {
        "id": "synthetic:v2:curve#v",
        "geometry": {
          "kind": "line",
          "origin": {
            "x": 0.0,
            "y": 0.0,
            "z": 0.0
          },
          "direction": {
            "x": 0.0,
            "y": 1.0,
            "z": 0.0
          }
        }
      }
    ],
    "subds": [
      {
        "id": "synthetic:v2:subd#directed",
        "scheme": "catmull_clark",
        "vertices": [
          {
            "point": {
              "x": 0.0,
              "y": 0.0,
              "z": 0.0
            },
            "tag": "crease"
          },
          {
            "point": {
              "x": 1.0,
              "y": 0.0,
              "z": 0.0
            },
            "tag": "smooth"
          },
          {
            "point": {
              "x": 0.0,
              "y": 1.0,
              "z": 0.0
            },
            "tag": "corner"
          }
        ],
        "edges": [
          {
            "vertices": [
              0,
              1
            ],
            "sharpness": [
              0.25,
              0.75
            ],
            "tag": "crease",
            "sector_coeffic