{"irVersion":"0","units":"mm","tolerances":{"resabs":1e-6,"resnor":1e-10},"bodies":[],"lumps":[],"shells":[],"faces":[],"loops":[],"coedges":[],"edges":[],"vertices":[],"points":[],"surfaces":[],"curves":[],"pcurves":[],"unknowns":[]}