{
  "ir_version": "56",
  "units": {
    "length": "millimeter"
  },
  "tolerances": {
    "linear": 1e-6,
    "angular": 1e-10
  },
  "model": {
    "bodies": [
      {
        "id": "synthetic:cube:body#0",
        "kind": "solid",
        "regions": [
          "synthetic:cube:region#0"
        ],
        "name": "unit cube"
      }
    ],
    "regions": [
      {
        "id": "synthetic:cube:region#0",
        "body": "synthetic:cube:body#0",
        "shells": [
          "synthetic:cube:shell#0"
        ]
      }
    ],
    "shells": [
      {
        "id": "synthetic:cube:shell#0",
        "region": "synthetic:cube:region#0",
        "faces": [
          "synthetic:cube:face#bottom",
          "synthetic:cube:face#top",
          "synthetic:cube:face#front",
          "synthetic:cube:face#right",
          "synthetic:cube:face#back",
          "synthetic:cube:face#left"
        ]
      }
    ],
    "faces": [
      {
        "id": "synthetic:cube:face#back",
        "shell": "synthetic:cube:shell#0",
        "surface": "synthetic:cube:surface#back",
        "sense": "forward",
        "loops": [
          "synthetic:cube:loop#back"
        ],
        "name": "back face"
      },
      {
        "id": "synthetic:cube:face#bottom",
        "shell": "synthetic:cube:shell#0",
        "surface": "synthetic:cube:surface#bottom",
        "sense": "forward",
        "loops": [
          "synthetic:cube:loop#bottom"
        ],
        "name": "bottom face"
      },
      {
        "id": "synthetic:cube:face#front",
        "shell": "synthetic:cube:shell#0",
        "surface": "synthetic:cube:surface#front",
        "sense": "forward",
        "loops": [
          "synthetic:cube:loop#front"
        ],
        "name": "front face"
      },
      {
        "id": "synthetic:cube:face#left",
        "shell": "synthetic:cube:shell#0",
        "surface": "synthetic:cube:surface#left",
        "sense": "forward",
        "loops": [
          "synthetic:cube:loop#left"
        ],
        "name": "left face"
      },
      {
        "id": "synthetic:cube:face#right",
        "shell": "synthetic:cube:shell#0",
        "surface": "synthetic:cube:surface#right",
        "sense": "forward",
        "loops": [
          "synthetic:cube:loop#right"
        ],
        "name": "right face"
      },
      {
        "id": "synthetic:cube:face#top",
        "shell": "synthetic:cube:shell#0",
        "surface": "synthetic:cube:surface#top",
        "sense": "forward",
        "loops": [
          "synthetic:cube:loop#top"
        ],
        "name": "top face"
      }
    ],
    "loops": [
      {
        "id": "synthetic:cube:loop#back",
        "face": "synthetic:cube:face#back",
        "boundary_role": "outer",
        "coedges": [
          "synthetic:cube:coedge#back:0",
          "synthetic:cube:coedge#back:1",
          "synthetic:cube:coedge#back:2",
          "synthetic:cube:coedge#back:3"
        ]
      },
      {
        "id": "synthetic:cube:loop#bottom",
        "face": "synthetic:cube:face#bottom",
        "boundary_role": "outer",
        "coedges": [
          "synthetic:cube:coedge#bottom:0",
          "synthetic:cube:coedge#bottom:1",
          "synthetic:cube:coedge#bottom:2",
          "synthetic:cube:coedge#bottom:3"
        ]
      },
      {
        "id": "synthetic:cube:loop#front",
        "face": "synthetic:cube:face#front",
        "boundary_role": "outer",
        "coedges": [
          "synthetic:cube:coedge#front:0",
          "synthetic:cube:coedge#front:1",
          "synthetic:cube:coedge#front:2",
          "synthetic:cube:coedge#front:3"
        ]
      },
      {
        "id": "synthetic:cube:loop#left",
        "face": "synthetic:cube:face#left",
        "boundary_role": "outer",
        "coedges": [
          "synthetic:cube:coedge#left:0",
          "synthetic:cube:coedge#left:1",
          "synthetic:cube:coedge#left:2",
          "synthetic:cube:coedge#left:3"
        ]
      },
      {
        "id": "synthetic:cube:loop#right",
        "face": "synthetic:cube:face#right",
        "boundary_role": "outer",
        "coedges": [
          "synthetic:cube:coedge#right:0",
          "synthetic:cube:coedge#right:1",
          "synthetic:cube:coedge#right:2",
          "synthetic:cube:coedge#right:3"
        ]
      },
      {
        "id": "synthetic:cube:loop#top",
        "face": "synthetic:cube:face#top",
        "boundary_role": "outer",
        "coedges": [
          "synthetic:cube:coedge#top:0",
          "synthetic:cube:coedge#top:1",
          "synthetic:cube:coedge#top:2",
          "synthetic:cube:coedge#top:3"
        ]
      }
    ],
    "coedges": [
      {
        "id": "synthetic:cube:coedge#back:0",
        "owner_loop": "synthetic:cube:loop#back",
        "edge": "synthetic:cube:edge#2",
        "next": "synthetic:cube:coedge#back:1",
        "previous": "synthetic:cube:coedge#back:3",
        "radial_next": "synthetic:cube:coedge#bottom:2",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#back:1",
        "owner_loop": "synthetic:cube:loop#back",
        "edge": "synthetic:cube:edge#10",
        "next": "synthetic:cube:coedge#back:2",
        "previous": "synthetic:cube:coedge#back:0",
        "radial_next": "synthetic:cube:coedge#right:3",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#back:2",
        "owner_loop": "synthetic:cube:loop#back",
        "edge": "synthetic:cube:edge#6",
        "next": "synthetic:cube:coedge#back:3",
        "previous": "synthetic:cube:coedge#back:1",
        "radial_next": "synthetic:cube:coedge#top:1",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#back:3",
        "owner_loop": "synthetic:cube:loop#back",
        "edge": "synthetic:cube:edge#11",
        "next": "synthetic:cube:coedge#back:0",
        "previous": "synthetic:cube:coedge#back:2",
        "radial_next": "synthetic:cube:coedge#left:1",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#bottom:0",
        "owner_loop": "synthetic:cube:loop#bottom",
        "edge": "synthetic:cube:edge#0",
        "next": "synthetic:cube:coedge#bottom:1",
        "previous": "synthetic:cube:coedge#bottom:3",
        "radial_next": "synthetic:cube:coedge#front:0",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#bottom:1",
        "owner_loop": "synthetic:cube:loop#bottom",
        "edge": "synthetic:cube:edge#1",
        "next": "synthetic:cube:coedge#bottom:2",
        "previous": "synthetic:cube:coedge#bottom:0",
        "radial_next": "synthetic:cube:coedge#right:0",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#bottom:2",
        "owner_loop": "synthetic:cube:loop#bottom",
        "edge": "synthetic:cube:edge#2",
        "next": "synthetic:cube:coedge#bottom:3",
        "previous": "synthetic:cube:coedge#bottom:1",
        "radial_next": "synthetic:cube:coedge#back:0",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#bottom:3",
        "owner_loop": "synthetic:cube:loop#bottom",
        "edge": "synthetic:cube:edge#3",
        "next": "synthetic:cube:coedge#bottom:0",
        "previous": "synthetic:cube:coedge#bottom:2",
        "radial_next": "synthetic:cube:coedge#left:0",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#front:0",
        "owner_loop": "synthetic:cube:loop#front",
        "edge": "synthetic:cube:edge#0",
        "next": "synthetic:cube:coedge#front:1",
        "previous": "synthetic:cube:coedge#front:3",
        "radial_next": "synthetic:cube:coedge#bottom:0",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#front:1",
        "owner_loop": "synthetic:cube:loop#front",
        "edge": "synthetic:cube:edge#8",
        "next": "synthetic:cube:coedge#front:2",
        "previous": "synthetic:cube:coedge#front:0",
        "radial_next": "synthetic:cube:coedge#left:3",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#front:2",
        "owner_loop": "synthetic:cube:loop#front",
        "edge": "synthetic:cube:edge#4",
        "next": "synthetic:cube:coedge#front:3",
        "previous": "synthetic:cube:coedge#front:1",
        "radial_next": "synthetic:cube:coedge#top:3",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#front:3",
        "owner_loop": "synthetic:cube:loop#front",
        "edge": "synthetic:cube:edge#9",
        "next": "synthetic:cube:coedge#front:0",
        "previous": "synthetic:cube:coedge#front:2",
        "radial_next": "synthetic:cube:coedge#right:1",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#left:0",
        "owner_loop": "synthetic:cube:loop#left",
        "edge": "synthetic:cube:edge#3",
        "next": "synthetic:cube:coedge#left:1",
        "previous": "synthetic:cube:coedge#left:3",
        "radial_next": "synthetic:cube:coedge#bottom:3",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#left:1",
        "owner_loop": "synthetic:cube:loop#left",
        "edge": "synthetic:cube:edge#11",
        "next": "synthetic:cube:coedge#left:2",
        "previous": "synthetic:cube:coedge#left:0",
        "radial_next": "synthetic:cube:coedge#back:3",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#left:2",
        "owner_loop": "synthetic:cube:loop#left",
        "edge": "synthetic:cube:edge#7",
        "next": "synthetic:cube:coedge#left:3",
        "previous": "synthetic:cube:coedge#left:1",
        "radial_next": "synthetic:cube:coedge#top:0",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#left:3",
        "owner_loop": "synthetic:cube:loop#left",
        "edge": "synthetic:cube:edge#8",
        "next": "synthetic:cube:coedge#left:0",
        "previous": "synthetic:cube:coedge#left:2",
        "radial_next": "synthetic:cube:coedge#front:1",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#right:0",
        "owner_loop": "synthetic:cube:loop#right",
        "edge": "synthetic:cube:edge#1",
        "next": "synthetic:cube:coedge#right:1",
        "previous": "synthetic:cube:coedge#right:3",
        "radial_next": "synthetic:cube:coedge#bottom:1",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#right:1",
        "owner_loop": "synthetic:cube:loop#right",
        "edge": "synthetic:cube:edge#9",
        "next": "synthetic:cube:coedge#right:2",
        "previous": "synthetic:cube:coedge#right:0",
        "radial_next": "synthetic:cube:coedge#front:3",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#right:2",
        "owner_loop": "synthetic:cube:loop#right",
        "edge": "synthetic:cube:edge#5",
        "next": "synthetic:cube:coedge#right:3",
        "previous": "synthetic:cube:coedge#right:1",
        "radial_next": "synthetic:cube:coedge#top:2",
        "sense": "forward"
      },
      {
        "id": "synthetic:cube:coedge#right:3",
        "owner_loop": "synthetic:cube:loop#right",
        "edge": "synthetic:cube:edge#10",
        "next": "synthetic:cube:coedge#right:0",
        "previous": "synthetic:cube:coedge#right:2",
        "radial_next": "synthetic:cube:coedge#back:1",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#top:0",
        "owner_loop": "synthetic:cube:loop#top",
        "edge": "synthetic:cube:edge#7",
        "next": "synthetic:cube:coedge#top:1",
        "previous": "synthetic:cube:coedge#top:3",
        "radial_next": "synthetic:cube:coedge#left:2",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#top:1",
        "owner_loop": "synthetic:cube:loop#top",
        "edge": "synthetic:cube:edge#6",
        "next": "synthetic:cube:coedge#top:2",
        "previous": "synthetic:cube:coedge#top:0",
        "radial_next": "synthetic:cube:coedge#back:2",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cube:coedge#top:2",
        "owner_loop": "synthetic:cube:loop#top",
        "edge": "synthetic:cube:edge#5",
        "next": "synthetic:cube:coedge#top:3",
        "previous": "synthetic:cube:coedge#top:1",
        "radial_next": "synthetic:cube:coedge#right:2",
        "sense": "reversed"
      },
      {
        "id": "synthetic:cub