{
  "ir_version": "0",
  "units": {
    "length": "millimeter"
  },
  "tolerances": {
    "linear": 1e-6,
    "angular": 1e-10
  },
  "model": {
    "bodies": [],
    "regions": [],
    "shells": [],
    "faces": [],
    "loops": [],
    "coedges": [],
    "edges": [],
    "vertices": [],
    "points": [],
    "surfaces": [],
    "curves": [],
    "subds": [],
    "pcurves": [],
    "procedural_surfaces": [],
    "procedural_curves": [],
    "features": [],
    "feature_input_topologies": [],
    "configurations": [],
    "parameters": [],
    "sketches": [],
    "sketchĀentities": [],
    "sketch_constraints": [],
    "spatial_sketches": [],
    "spatial_sketch_entities": [],
    "spatial_sketch_constraints": [],
    "spreadsheets": [],
    "components": [],
    "occurrences": [],
    "assembly_joints": [],
    "drawings": [],
    "semantic_annotations": [],
    "presentation_documents": [],
    "view_presentations": [],
    "tessellations": [],
    "appearances": [],
    "appearance_bindings": [],
    "attributes": [],
    "products": [],
    "product_occurrences": [],
    "pmi": [],
    "presentation_layers": []
  },
  "native": {}
}